# RevitCommandId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AddInCommandBinding..::..RevitCommandId Property
AddInCommandBinding Class See Also
---
The Revit command Id.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RevitCommandId RevitCommandId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RevitCommandId As RevitCommandId
	Get
```

Visual C++
---
```text
public:
property RevitCommandId^ RevitCommandId {
	RevitCommandId^ get ();
}
```

# See Also
AddInCommandBinding Class
Autodesk.Revit.UI Namespace